#ifndef I2C_H
#define I2C_H

//----------------------------------------------------------------------------------------------------
//библиотеки
//----------------------------------------------------------------------------------------------------

#include <stdint.h>

//----------------------------------------------------------------------------------------------------
//прототипы функций
//----------------------------------------------------------------------------------------------------
bool I2C_Init(void);//инициализация
bool I2C_WriteBuffer(uint8_t addr,uint8_t *buffer,uint8_t buffer_size);//передать данные
bool I2C_ReadBuffer(uint8_t addr,uint8_t reg_addr,uint8_t *buffer,uint8_t buffer_size);//принять данные

#endif
