#ifndef MPU6050_H
#define MPU6050_H

//----------------------------------------------------------------------------------------------------
//библиотеки
//----------------------------------------------------------------------------------------------------

#include <stdint.h>

//----------------------------------------------------------------------------------------------------
//прототипы функций
//----------------------------------------------------------------------------------------------------

void MPU6050_Init(void);//инициализация
int16_t MPU6050_GetTemper(void);//получить температуру
int16_t MPU6050_GetAcselX(void);//получить показания акселерометра по оси X
int16_t MPU6050_GetAcselY(void);//получить показания акселерометра по оси Y
int16_t MPU6050_GetAcselZ(void);//получить показания акселерометра по оси Z

int16_t MPU6050_GetGyroX(void);//получить показания гироскопа оси X
int16_t MPU6050_GetGyroY(void);//получить показания гироскопа оси X
int16_t MPU6050_GetGyroZ(void);//получить показания гироскопа оси X

void MPU6050_ReadAll(int16_t &gx,int16_t &gy,int16_t &gz,int16_t &ax,int16_t &ay,int16_t &az,int16_t &temper);//считать показания гироскопов, акселерометров и температуры блоком

#endif
